app/controllers/comments_controller.rb

INSERT INTO "comments" ("author_id", "author_name", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author_id", 1], ["author_name", "jackie"], ["body", "bonjour merci pour le ciné "], ["created_at", Thu, 26 Sep 2013 13:33:51 UTC +00:00], ["updated_at", Thu, 26 Sep 2013 13:33:51 UTC +00:00]]
---
def create              # le submit va chercher la methode create
  @comments = Comment.new(comment_params)
  @comments.profil_id = params[:profil_id]




  @comments.save   #on sauvegarde