app/controllers/offres_controller.rb

SELECT "offres".* FROM "offres"
---
def index

 @offres=Offre.all

SELECT "offres".* FROM "offres" WHERE "offres"."id" = ? LIMIT 1  [["id", "1"]]
---
def show


 @offres = Offre.find(params[:id]) #reccupere l'id de l url

INSERT INTO "offres" ("created_at", "description", "nom_restaurant", "photo", "prix_large", "prix_medium", "profil_id", "titre", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
def create              # le submit va chercher la methode create


  @offres = Offre.new(profil_params)
  @offres.nom_restaurant = params[:offre][:nom_restaurant]  # on reccupere le nom du form
  @offres.titre = params[:offre][:titre]  # on reccupere le nom du form
  @offres.description = params[:offre][:description] # on reccupere le body du form
  @offres.prix_medium = params[:offre][:prix_medium]  # on reccupere le nom du form
  @offres.prix_large = params[:offre][:prix_large]  # on reccupere le
  @offres.photo = params[:offre][:photo]
  @offres.profil_id ="8"
  @offres.save   #on sauvegarde